Tekla.Structures.ModelInternal.Rotation3DDataConversion
Conversion of Tekla.Structures.Model.Geometry.Rotation3D to and from tuple representation.
Remarks: Needed for use with Contracts.

Tekla.Structures.ModelInternal.Rotation3DDataConversion.From(System.Tuple{System.Tuple{System.Double,System.Double,System.Double},System.Tuple{System.Double,System.Double,System.Double}})
Converts tuple representation to Tekla.Structures.Model.Geometry.Rotation3D.
rotationData: The rotation data, encoded as tuples.
Returns: The Tekla.Structures.Model.Geometry.Rotation3D instance.

Tekla.Structures.ModelInternal.Rotation3DDataConversion.To(Tekla.Structures.Model.Geometry.Rotation3D)
Converts Tekla.Structures.Model.Geometry.Rotation3D to tuple representation.
rotation: The Tekla.Structures.Model.Geometry.Rotation3D instance.
Returns: The rotation data, encoded as tuples.